import React, { Component } from "react";
import { connect } from "react-redux";
import MenuTitle from "../../../components/UI/MenuTitle/MenuTitle";
import SocialSection from "../../../components/UI/Social/Social";
import img from "../../../assets/images/News/imgss.jpg";
import style from "./index.css";

class NewsDetail extends Component {
  render() {
    return (
      <div>
        <MenuTitle title="News" />
        <div className={style.newsDetailSection}>
          <div className={style.newsDetailContainer}>
            <img className={style.newsDetailImg} src={img} />
            <h1 className={style.newsDetailTitle}>
              Moot Court Competition is Announced
            </h1>
            <p className={style.newsDetailText}>
              ХӨСҮТ-ийн Тандалт, судалгааны албаны дарга А.Амбасэлмаа: Өнөөдрийн
              байдлаар ажиглалт тусгаарлалтын байранд шинээр 24 хүн орж, нэг хүн
              гарсан. Одоо 2784 хүн тусгаарлалтад байна. Үүнд 1-5 насны 95
              хүүхэд, жирэмсэн эх 108, архаг хууч өвчтэй 327 хүн байгаа юм. Үүнд
              нийт 41 их эмч, 71 резидент эмч ажиллаж, эмчилгээ үйлчилгээ үзүүлж
              байгаа бол Цэргийн төв эмнэлэгт 52 хүн байгаагаас эрчимт
              эмчилгээний тасагт дөрвөн хүн байна. ХӨСҮТ-ийн захирал Д.Нямхүү:
              Өнгөрсөн 24 цагийн хугацаанд 330 хүний сорьцод коронавирус
              илрүүлэх шинжилгээ хийхэд бүгдэд нь илрээгүй. Энэ 330 хүний задалж
              хэлбэл, -Долдугаар сарын 4-нд Токио-Улаанбаатар онгоцоор ирсэн 253
              хүний давтан шинжилгээ -ХӨСҮТ-д сэжигтэй хэмээн тусгаарлагдсан 7
              хүний давтан шинжилгээ -Дорноговь аймгийн Хангимандалын боомтоор
              орж ирсэн ачаа тээврийн 24 жолоочийн шинжилгээ -Алтанбулагийн
              боомтоор орж ирсэн ачаа тээврийн 18 жолоочийн шинжилгээ
              -Дархан-Уул аймагт тусгаарлагдсан 4 хүний шинжилгээ -Эдгэрч
              дараагийн сувилалд шилжсэн 24 хүний шинжилгээ орж байна. Ингээд
              манай улсад албан ёсоор батлагдсан 287 тохиолдол байгаагаас 213 нь
              эдгэрсэн. Одоо ХӨСҮТ-д 74 хүн эмчлэгдэж байна. Үүнээс 64 нь
              хөнгөн, 10 хүн хүндэвтэр байна. Мөн эмчилгээнд нэг жирэмсэн эх
              байгаа юм. ХӨСҮТ-д ажиглалт, тандалт, эмчилгээ гээд нийт 116 хүн
              байна. Бид чартераар ирэх хүмүүсийг хүлээж авах бэлтгэл ажлаа
              бүрэн ханган хүлээж байна.
            </p>
          </div>
          <div className={style.socialContainer}>
            <SocialSection />
          </div>
        </div>
      </div>
    );
  }
}

export default NewsDetail;
